docs/Rotate.tex
% Created 2019-01-26 Sat 08:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern}
\author{adam}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={adam},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.1.7)}, 
 pdflang={English}}
\begin{document}

\tableofcontents



\section{Rotating the image to minimize}
\label{sec:orgf605563}
\subsection{helper functions}
\label{sec:org5db7722}
\subsection{getWH}
\label{sec:orgdc635ed}
\begin{itemize}
\item threshold the image
\item get the roi
\item get the bounds of the roi
\item crop the image
\item find its width and height
\end{itemize}
\subsection{getAngle}
\label{sec:orgecf3ec5}
\begin{itemize}
\item measure getWH at each rotation angle
\item whole image is rotated using bilinear interpolation from imagej
\item the rotated image is then passed through getWH
\item compare the height of the image is smaller than the previous height
keep rotating the image
\item the idea is that the image with smallest height is the best aligned
image
\item this method only works for root systems which are wider than tall
\end{itemize}

\subsection{lineExtent}
\label{sec:orgfb15970}
\begin{itemize}
\item scan a line from left to right
\item on the first black pixel that it encounters, set it to the left
boundary
\item on the last white pixel that it encounters, set it to the right
boundary
\item the lineExtent is the diff of these two numbers (+1)
\end{itemize}
\subsection{getVolumeFromExtents}
\label{sec:org7734fd9}
\begin{itemize}
\item calculate the volume by computing the area of the slice
\item use lineExtent to get the diameter, then use it to compute
\item d*d/4 * pi
\item since each pixel is of height one, the volume is simply
the accumulation of the all the areas above
\end{itemize}
\subsection{getVolume}
\label{sec:org2850c2b}
\begin{itemize}
\item same a getVolumeFromExtents but we rotate the image first
\item this is necessary because the unaligned images have incorrect
radial thinning as calculated with the volume from line extent
\end{itemize}
\end{document}
